---
title: PointCloudOverrideSettings
classe: Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings
namespace: Autodesk.Revit.DB.PointClouds
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# PointCloudOverrideSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `PointCloudColorMode ColorMode { get; set; }` | `pointCloudOverrideSettings.ColorMode` | PointCloudColorMode |
| `Boolean IsValidObject { get; }` | `pointCloudOverrideSettings.IsValidObject` | Boolean |
| `Boolean Visible { get; set; }` | `pointCloudOverrideSettings.Visible` | Boolean |
| `Void Assign(PointCloudOverrideSettings)` | `pointCloudOverrideSettings.Assign(other)` | Void |
| `Void Dispose()` | `pointCloudOverrideSettings.Dispose()` | Void |
| `PointCloudColorSettings GetModeOverride(PointCloudColorMode)` | `pointCloudOverrideSettings.GetModeOverride(mode)` | PointCloudColorSettings |
| `Boolean IsEqual(PointCloudOverrideSettings)` | `pointCloudOverrideSettings.IsEqual(other)` | Boolean |
| `Void SetModeOverride(PointCloudColorMode, PointCloudColorSettings)` | `pointCloudOverrideSettings.SetModeOverride(mode, colorSettings)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```